{
    "Copy of Role of integration engineer - R&D and Production.xlsx": [
        "What is the main advantage of designing an electronic system in modular form?",
        "Which of the following best describes a functional module?",
        "Why are modular systems easier to upgrade?",
        "Which of the following cables is used for digital communication?",
        "Why should power and signal cables be separated during routing?",
        "What is the purpose of using cable clamps during integration?",
        "Why should cables be labeled during assembly?",
        "What does an integration plan primarily define?",
        "Why is documentation important in integration?",
        "What should be verified before powering up the system?",
        "Why is torque control important during mechanical mounting?",
        "What is the purpose of pre-power checks?",
        "What is observed during staged power-up of an electronic system?",
        "What is the primary responsibility of an integration engineer?",
        "What is the purpose of debugging during integration?",
        "What distinguishes R and D integration from production integration?",
        "What does a Standard Operating Procedure (S O P) ensure in production integration?",
        "Why is documenting integration issues important?",
        "Who ensures coordination between R and D and testing teams?",
        "Why is integration called the bridge between design and manufacturing?"
    ],
    "Copy of UARTSPII2C interface setup, bootloader flashing, serial debug tools.xlsx": [
        "Which device is best suited for real-time control of sensors and actuators?",
        "Which device typically requires external memory and peripherals?",
        "Which device is used to implement custom digital logic functions?",
        "Which device commonly runs Linux-based applications?",
        "Which tool is specifically used to program STM microcontrollers?",
        "Which tool is used for FPGA synthesis and programming?",
        "Which IDE is mainly used for AVR microcontrollers?",
        "What is the primary purpose of a bootloader?",
        "Which bootloader is commonly used for ARM-based Linux systems?",
        "What defines where the bootloader loads the application code?",
        "Which method verifies firmware integrity after flashing?",
        "Which indicator confirms that firmware has started executing correctly?",
        "What process ensures that memory content matches the flashed firmware?",
        "Which tool type automates firmware flashing and verification?",
        "Which system performs automatic firmware builds on code changes?",
        "What does Hardware-in-the-loop testing use to validate embedded systems?",
        "Which tool allows debugging over JTAG using GDB?",
        "Which method checks board-level pin connections?",
        "Why are ESD precautions important during programming?",
        "Why is power isolation recommended when programming hardware?"
    ],
    "Copy of Understanding DAC digital words to output signal synthesis, amplitude and timing aspects part1.xlsx": [
        "Which architecture uses a repeating R2R network and is common for medium-resolution control outputs?",
        "Which DAC type is typically chosen for high sample rate and good SFDR in wireless/baseband work?",
        "A DAC for audio stimulus needs very low in-band noise but only modest bandwidth. Which type is best?",
        "For a 12-bit DAC with 0–5 V full-scale, what is the LSB size?",
        "The ideal quantization SNR for a 14-bit DAC is closest to which value?",
        "Which condition guarantees a monotonic DAC transfer?",
        "A 16-bit DAC on SPI at 4 MHz (16-bit frame) can receive about how many updates per second?",
        "If settling time is 20 µs, which update period best follows the “five to ten times” guideline?",
        "Why use LVDS for a high-speed parallel DAC interface?",
        "The main purpose of the post-DAC low-pass filter is to:",
        "A drawback of binary-weighted resistor DACs at high bit counts is primarily:",
        "A design shows large spikes when crossing mid-scale. What is the best first mitigation?",
        "For battery IoT set-point control with modest update rate, which DAC family is most suitable?",
        "In a source-synchronous parallel DAC link, timing closure mainly requires:",
        "A measured SINAD of 68 dB corresponds to about what ENOB?",
        "Which statement about capacitive (charge-redistribution) DACs is true?",
        "For a 100 kHz sine from a zero-order-hold DAC at 1 MSPS, a sensible single-pole f_c is closest to:",
        "A 16-bit DAC fed by QSPI (4 data bits per clock) at 20 MHz can receive approximately how many updates per second (ignore protocol overhead)?",
        "If a loop needs steps fully settled and the DAC settles in 5 µs, what is a safe maximum update rate?",
        "In a synchronized 8-channel, 1 MSPS system, which feature ensures all outputs change together?"
    ],
    "Copy of Safety skills and habits for personal and item safetypart2.xlsx": [
        "What is the relationship between EMI and EMC?",
        "Which statement correctly contrasts conducted and radiated EMI?",
        "Why should long unshielded cables be avoided?",
        "What is the main risk of leaving an RF cable unterminated?",
        "Which grounding approach best prevents ground loops?",
        "The best toolset to sniff local RF leakage on a PCB/enclosure is:",
        "Which is a common EMI source?",
        "On a mixed-signal PCB, which practice reduces EMI risk?",
        "Where should ferrites/filters be placed primarily?",
        "During field troubleshooting, which action helps isolate an EMI source?",
        "Shielding effectiveness of 60 dB implies the internal field is:",
        "Which test is part of product assembly compliance?",
        "Which cable practice most improves shielding continuity?",
        "A symptom of radiated EMI is most likely:",
        "To control reflections on high-speed/RF lines you should:",
        "Why perform pre-compliance EMI/EMC scans?",
        "Which routing choice reduces EMI risk?",
        "An integration engineer’s key certification-prep responsibility is to:",
        "What primarily causes a ground loop?",
        "Which Hi-Pot choice best reflects a realistic test level?"
    ],
    "Copy of Understanding the power cable losses. Application.xlsx": [
        "If a D C cable carries 8 A with a resistance of 0.05 Ω, what is the voltage drop?",
        "When cable length doubles, how does voltage drop change (current same)?",
        "A 48 V supply drops 0.48 V along a cable. What is the approximate voltage drop percentage?",
        "For a 5 m one-way D C feed, which total length is used in drop calculation?",
        "If current doubles, how do cable losses change (resistance constant)?",
        "Which method most effectively reduces cable power loss?",
        "If 10 A flows through cable resistance of 0.046 Ω, power loss is:",
        "Why is minimizing I²R loss important in long-running systems?",
        "Which of these has the thickest conductor?",
        "What is the cross-section area of 16 A W G wire approximately?",
        "Recommended max voltage drop in low-voltage electronics is about:",
        "What is the main drawback of choosing thicker cable?",
        "Which factor increases cable resistance during operation?",
        "Why must ampacity be derated in bundled cables?",
        "Why should power and signal cables be routed separately?",
        "Which instrument helps detect overheating in cables?",
        "If cable losses increase, what happens to overall system efficiency?",
        "In constant power load, what is effect of doubling supply voltage?",
        "Which parameter primarily causes voltage drop in a cable?",
        "Why must cable insulation be rated above operating voltage?"
    ],
    "Copy of Understanding DAC digital words to output signal synthesis, amplitude and timing aspects part2.xlsx": [
        "What is the primary function of a DAC?",
        "What defines the resolution of a DAC?",
        "Which DAC architecture uses a repeating resistor ladder?",
        "Which DAC type is generally used for high speed RF applications?",
        "LSB value depends on which factor?",
        "Where do harmonic frequencies occur relative to the fundamental?",
        "Why do spectral images appear in a DAC output?",
        "What does the Nyquist rule require?",
        "Why does quantization noise exist in DACs?",
        "What causes aliasing?",
        "What is the purpose of an anti imaging filter?",
        "Which filter type is typically used after a DAC?",
        "What determines the cutoff frequency of the anti imaging filter?",
        "What does the anti imaging filter suppress?",
        "Which technique helps improve DAC spectral quality before the analog filter?",
        "What does INL represent in a DAC?",
        "Why must settling time be small in control applications?",
        "What does SDFR measure?",
        "What degrades SDFR in high speed DACs?",
        "Why is a low noise reference important for DACs?"
    ],
    "Copy of Technical drawing reading, connector identification.xlsx": [
        "What does a continuous thick line indicate in a technical drawing?",
        "What does a dashed line represent?",
        "What does a chain line indicate?",
        "What is the purpose of a leader line?",
        "A dimension shown as 20 ±0.1 means?",
        "What does the Ø symbol represent in technical drawings?",
        "The notation Ra 3.2 µm on a drawing specifies:",
        "What does the flatness control symbol in G D and T ensure?",
        "What does ⊥ 0.05 A represent in G D and T?",
        "The position tolerance symbol (Ⓟ) in G D and T controls:",
        "Why is Aluminum 6061-T6 commonly used for sensor brackets?",
        "The purpose of anodizing an aluminum part is to:",
        "Why is surface finish important in mechanical integration?",
        "Which parameter defines the surface roughness level?",
        "What do section lines (hatching) show in a drawing?",
        "What are datums used for in technical drawings?",
        "What does the revision block in a drawing indicate?",
        "What information is typically found in a title block?",
        "Why is it important to check the projection type (1st or 3rd angle)?",
        "Why are sectional views used in integration drawings?"
    ],
    "Copy of RF safety.xlsx": [
        "In RF safety, what does “power density” measure?",
        "Which organization publishes widely used international public RF exposure guidelines?",
        "The typical FCC public RF exposure limit below 6 GHz is closest to:",
        "Which formula gives far-field power density from a transmitter?",
        "If EIRP doubles, to keep within the same power-density limit, the safe distance R must:",
        "For a 900 MHz site with EIRP = 1000 W and limit 4.5 W/m², what is the safe distance R?",
        "If EIRP = 1000 W and R = 5 m, the power density S is approximately:",
        "Which frequency in the list has the highest indicative public limit (W/m²)?",
        "Which on-site practice is recommended near sector antennas?",
        "Why should workers avoid standing in the antenna’s main beam?",
        "Which tool is primarily used to measure RF field strength at a site?",
        "To locate unintended RF leakage on hardware, engineers commonly use:",
        "During interference troubleshooting, which step helps isolate the culprit?",
        "In the automotive infotainment case, what fix restored GPS integrity?",
        "The indicative public limit at 900 MHz is closest to:",
        "Which inequality represents a “safe” exposure condition?",
        "Where should EMI filters or ferrites be placed for best effect?",
        "The indicative public exposure limit at 1800 MHz is approximately:",
        "If you increase distance from the antenna by 3×, power density reduces by a factor of:",
        "In certification, a key role of integration engineers is to:"
    ],
    "Copy of Safety skills and habits for personal and item safetypart1.xlsx": [
        "What is the typical FCC power-density limit for public exposure below 6 GHz?",
        "Which SAR limit corresponds to the FCC requirement?",
        "Which formula defines shielding effectiveness (electric field)?",
        "A common target shielding effectiveness for sensitive products is:",
        "A frequent cause of RF leakage from cables is:",
        "Best quick mitigation for cable radiation on a long lead is:",
        "Which grounding approach helps avoid ground loops during integration?",
        "Which test checks dielectric strength across insulation barriers?",
        "Which tool is used to locate local RF leakage points on a PCB?",
        "What is the main purpose of an anechoic chamber in RF/EMC work?",
        "In the wearable ECG case, the pre-compliance failure was mainly due to:",
        "Which fix most directly addressed the ECG patch noise?",
        "Which action most effectively reduces human RF exposure from a small transmitter?",
        "If E1/E2 = 100, what is the shielding effectiveness (dB)?",
        "Which standard focuses on medical electrical safety?",
        "Which standard is for automotive functional safety?",
        "Which test directly assesses current from accessible parts to ground?",
        "First step to observe interference in the field is typically to:",
        "A Wi-Fi router failing emissions on LAN leads is often fixed by:",
        "SAR (Specific Absorption Rate) measures:"
    ],
    "Copy of RF connector handling, coax cable routing, VSWR basics, antenna mounting orientation.xlsx": [
        "What is the standard characteristic impedance used in most RF circuits?",
        "Which V S W R value indicates a perfect match between source and load?",
        "Why do reflections occur in an RF transmission line?",
        "Why is a 3 dB attenuator used between two amplifier stages?",
        "What is the purpose of an isolator in an RF power chain?",
        "Which instrument is used to observe signal spectrum and harmonics in RF systems?",
        "Which instrument measures reflection coefficient and S-parameters?",
        "Which device is used to measure average and peak RF power levels?",
        "What is the function of a directional coupler in RF measurement?",
        "Why is calibration important in RF measurement instruments?",
        "Why should an amplifier never be powered ON with an open output?",
        "What is the main reason for using an E S D wrist strap when handling RF components?",
        "What is the purpose of using a 50 ohm dummy load in RF testing?",
        "Why is correct torque and cleanliness important for RF connectors?",
        "What must be checked before powering multiple RF stages?",
        "What is the correct order for integrating RF modules?",
        "What is the function of a band-pass filter in an RF system?",
        "What is the first step if high VSWR is observed during testing?",
        "What causes standing waves in transmission lines?",
        "Why is proper grounding important during RF module integration?"
    ],
    "Copy of CE, FCC, RoHS awareness, handling ESD precautions.xlsx": [
        "Which part of an I P code represents water protection?",
        "What does the digit “7” in IP67 indicate?",
        "IP65 rated devices can withstand:",
        "What is the purpose of conformal coating on PCBs?",
        "Why are pressure equalization vents used in sealed enclosures?",
        "The main purpose of EMI shielding is to:",
        "Which component is commonly used to suppress conducted EMI?",
        "Why is grounding important for EMI control?",
        "Which wiring practice reduces EMI pickup in signal cables?",
        "Which of these is not a heat transfer mechanism?",
        "What feature improves heat conduction in a PCB?",
        "What does derating mean in thermal design?",
        "Which combination represents active cooling?",
        "What defines a robust product design?",
        "Why is margin design important for robustness?",
        "Why are vibration isolators used in robust electronics?",
        "Which design element improves robustness in corrosive environments?",
        "What is the main goal of environmental stress testing?",
        "Which approach increases long-term product robustness?",
        "What confirms robustness before product release?"
    ],
    "Copy of Ground loops, shielding, EMIEMC basics.xlsx": [
        "In RF systems, which type of grounding ensures a low-impedance path for high-frequency currents?",
        "What is the correct practice for connecting digital and RF grounds?",
        "What is the role of chassis ground in electronic integration?",
        "The best grounding layout for mixed-signal systems is:",
        "A measurable voltage between two grounds indicates:",
        "How should cable shields be terminated to prevent ground loops?",
        "Why should cable shields be continuous from end to end?",
        "What is the function of conductive gaskets in enclosures?",
        "Why should sharp bends in shielded cables be avoided?",
        "What ensures proper EMI shielding in cable connectors?",
        "What is the primary purpose of using ferrite beads in RF integration?",
        "Common-mode chokes are mainly used to:",
        "What is the function of feedthrough capacitors in EMI control?",
        "Which system part is most likely to generate EMI?",
        "Why is EMI pre-compliance testing important?",
        "What happens when multiple ground paths exist between two points?",
        "Which instrument helps identify noise peaks from EMI issues?",
        "What is the purpose of integrating one module at a time?",
        "Why is isolation testing performed during troubleshooting?",
        "Why is verifying low-resistance ground bonding important?"
    ],
    "Copy of Electro-mechanical assembly, interface matching.xlsx": [
        "What does an exploded view primarily represent?",
        "Why are exploded views used in design and assembly?",
        "What type of information is displayed in exploded mechanical diagrams?",
        "How do exploded views assist integration engineers?",
        "Which of the following is a use of exploded diagrams?",
        "What is the benefit of tightening screws diagonally on PCBs?",
        "What can happen if screws are over-tightened?",
        "Which tool is used to apply precise torque during assembly?",
        "What is a result of following incorrect torque sequence?",
        "Why should torque tools be calibrated periodically?",
        "Why are adhesives such as Araldite used in assemblies?",
        "How do screw-fit connectors achieve vibration stability?",
        "Which of these is a common thread-locking adhesive?",
        "What is the effect of excessive adhesive use?",
        "What combination gives best vibration resistance?",
        "Which connector type is best for rugged applications?",
        "What is a limitation of press-fit connectors?",
        "Why is torque important in connector fixing?",
        "What is a result of connector misalignment?"
    ],
    "Copy of ACDC circuits.xlsx": [
        "Which of the following statements is true for Alternating Current (A C)?",
        "Which describes Direct Current (D C)?",
        "What function does a buck converter perform?",
        "What is the primary role of a boost converter?",
        "Which converter type can both increase and decrease voltage?",
        "Which is a characteristic of the LM2596 regulator?",
        "Switching regulators (e.g. LM2596) often exhibit output ripple around:",
        "What is the minimum input voltage required by a 5 V linear regulator like 7805 to maintain regulation?",
        "Which color convention is correct for D C power wiring?",
        "What is the correct test to confirm voltage regulation under load?",
        "Which safety step is essential before servicing a power circuit?",
        "Which is a common mains A C specification in many countries?",
        "What is an advantage of a switch‑mode power supply (SMPS) over a linear supply?",
        "Which equation correctly relates power, voltage, and current?",
        "On which instrument can you best observe output voltage ripple?",
        "Which factor strongly affects output ripple amplitude in a buck converter?",
        "Which two measurements help assess a converter’s regulation?",
        "What is a typical switching frequency for a buck converter like LM2596?",
        "What is the result of reversing polarity on the output?",
        "Why is connecting earth (ground) important in power supplies?"
    ],
    "Copy of Microwave & RF Passive components updated.xlsx": [
        "Which passive device is used to reduce signal level for gain control without altering the waveform?",
        "What is a common total attenuation range for step attenuators in RF systems?",
        "What are typical step sizes available in RF step attenuators?",
        "What is a typical insertion loss for a high‑quality RF attenuator (excluding programmed attenuation)?",
        "Which specification describes how constant attenuation remains across frequency in a step attenuator?",
        "How many distinct settings exist in a 0–31.5 dB step attenuator with 0.5 dB steps (including 0 dB)?",
        "You have 1 W (30 dBm) and need 10 dBm at the instrument. What attenuation should you set?",
        "What is the primary function of an RF isolator in a transmit chain?",
        "What isolation is typically expected from an RF isolator?",
        "What insertion loss figure aligns with typical isolator performance?",
        "Which bandwidth characteristic best describes ferrite isolators used in microwave systems?",
        "A directional coupler with 20 dB coupling samples how much power at the coupled port for a 1 W (30 dBm) input?",
        "What minimum directivity indicates a good quality directional coupler?",
        "What is a typical insertion loss for a through line in a directional coupler?",
        "What is the primary role of a balun in RF front‑ends?",
        "Which amplitude/phase balance specs indicate a high‑quality balun?",
        "Which of the following is NOT a standard RF filter type?",
        "Which set best matches typical RF band‑pass filter specs for 2.4 GHz systems?",
        "How does a 3‑port circulator route power ideally?",
        "In a chain, an attenuator (1.0 dB IL), coupler (0.5 dB IL), and isolator (0.5 dB IL) are cascaded. What is the total extra loss?"
    ],
    "Copy of Electronic Integration.xlsx": [
        "What is the main advantage of designing an electronic system in modular form?",
        "Which of the following best describes a functional module?",
        "Why are modular systems easier to upgrade?",
        "Which of the following cables is used for digital communication?",
        "Why should power and signal cables be separated during routing?",
        "What is the purpose of using cable clamps during integration?",
        "Why should cables be labeled during assembly?",
        "What does an integration plan primarily define?",
        "Why is documentation important in integration?",
        "What should be verified before powering up the system?",
        "Why is torque control important during mechanical mounting?",
        "What is the purpose of pre-power checks?",
        "What is observed during staged power-up of an electronic system?",
        "What is the primary responsibility of an integration engineer?",
        "What is the purpose of debugging during integration?",
        "What distinguishes R and D integration from production integration?",
        "What does a Standard Operating Procedure (S O P) ensure in production integration?",
        "Why is documenting integration issues important?",
        "Who ensures coordination between R and D and testing teams?",
        "Why is integration called the bridge between design and manufacturing?"
    ],
    "Copy of Microwave & RF Passive components.xlsx": [
        "Which type of attenuator provides a constant loss value regardless of input power?",
        "If an attenuator reduces power from 1 W to 0.1 W, what is the attenuation?",
        "What distinguishes a step attenuator from a fixed attenuator?",
        "What is the primary purpose of an attenuator in an RF chain?",
        "An attenuator with VSWR = 1.1 : 1 has what approximate return loss?",
        "What is the main function of an RF isolator?",
        "Which material property enables isolator operation?",
        "If an isolator has insertion loss = 0.5 dB and isolation = 20 dB, what does 20 dB represent?",
        "How can a circulator be used as an isolator?",
        "Which VSWR value indicates the best matching for an isolator?",
        "In a 20 dB directional coupler, what fraction of input power appears at the coupled port?",
        "What does the directivity of a directional coupler indicate?",
        "What is a typical application of a directional coupler?",
        "For a 6 dB coupler, how much power is coupled out of a 10 W input?",
        "How many ports does a typical directional coupler have?",
        "Which filter type allows signals below a cutoff frequency to pass?",
        "A Wi-Fi band-pass filter centered at 2.45 GHz passes which range most effectively?",
        "A filter with 40 dB stop-band attenuation means what?",
        "Which parameter defines amplitude variation in the pass-band?",
        "For a low-pass filter, the cutoff is defined at what attenuation point?",
        "If input power is 50 mW and output is 5 mW, what is the attenuation?",
        "Why is high isolation desirable in an isolator?",
        "What happens to a coupler’s coupling factor when frequency increases beyond design range?",
        "What is the primary role of an RF filter in communication systems?",
        "What is the unique feature of a programmable attenuator?"
    ],
    "Copy of Adjustment of sensor and output parameters, use of reference standards, calibration logs.xlsx": [
        "What is the primary goal of output calibration for a DC supply?",
        "Why are multiple set points used during output calibration?",
        "Which setup best verifies a DC supply’s displayed voltage?",
        "During calibration, the display reads 12.20 V and the calibrated meter reads 12.00 V. What should be done?",
        "A supply displays 5.05 V while the reference meter reads 5.00 V. What is the percentage display error?",
        "In calibrating a sound sensor system, what provides the “true value” for tuning the code’s gain?",
        "If the displayed loudness is lower than the known standard, what software change is most appropriate?",
        "The system always shows +2 dB too high regardless of level. What correction is needed?",
        "After tuning, you repeat the test with the same standard and get the same value. What property did you verify?",
        "A 12-bit A D C (0–5 V) reads 2100 counts for a 2.50 V standard. What is the count deviation from ideal?",
        "Which statement best describes a suitable reference instrument?",
        "Before using a reference meter, what must be checked?",
        "A DUT has 0.1% uncertainty; the reference has 0.02%. What is the Test Uncertainty Ratio (TUR)?",
        "TUR at a test point is 1.4. What is the best action?",
        "Why are temperature and humidity controlled during calibration?",
        "What is the main purpose of keeping detailed calibration records?",
        "Which statement about measurement uncertainty is correct?",
        "Why schedule periodic recalibration?",
        "A reference reads 12.00 V; the DUT shows 11.92 V. What is the absolute percentage error of the DUT display?",
        "Why is traceability to national standards essential in calibration?"
    ],
    "Copy of Cable issues and trouble shooting with instruments..xlsx": [
        "Which type of cable is primarily used to carry weak instrument signals with minimal noise interference?",
        "Twisted pair cables are mainly used to:",
        "What type of cable is commonly used for digital data communication in laboratories?",
        "The outer metallic layer in a shielded cable is primarily used for:",
        "If insulation color fades or cracks on a cable, what does it indicate?",
        "Power and signal cables should be routed:",
        "What is the recommended number of ends at which a cable shield should be grounded?",
        "The main reason to avoid sharp bends in cable routing is to:",
        "Which of the following helps reduce crosstalk between cables?",
        "A ground loop in an instrument cable can cause:",
        "When a multimeter shows infinite resistance between two ends of a cable, it means:",
        "A cable tester that reports “short circuit” indicates:",
        "The best instrument to observe waveform distortion in a signal cable is:",
        "While troubleshooting, the first step before using test equipment is to:",
        "In a communication cable, data packet loss is often due to:",
        "Preventive cable inspection should be done how often?",
        "Which tool is safest to use when working with energized circuits?",
        "During inspection, what action should be taken if a cable shows overheating marks?",
        "What is the correct sequence in a troubleshooting flowchart?",
        "Why should damaged insulation never be touched with bare hands?"
    ],
    "Copy of Cable types, current rating, derating principles.xlsx": [
        "Which material is most commonly used as a conductor in industrial cables?",
        "What is the primary function of the dielectric layer in a cable?",
        "What part of the cable protects it from mechanical damage and environmental exposure?",
        "Why are multi-strand conductors preferred in robotic or moving applications?",
        "Which dielectric material is most suitable for high-frequency, high-temperature applications?",
        "Increasing dielectric thickness primarily improves which property?",
        "Which type of shield provides both flexibility and mechanical protection?",
        "What is the main purpose of cable shielding?",
        "Which type of cable is used to transmit electrical power to motors or control panels?",
        "What cable type is used for low-level analog and digital signals in control systems?",
        "Which cable type is typically used for antenna and RF applications?",
        "Which of the following is an example of a data cable?",
        "Why are shielded cables used in automotive and industrial systems?",
        "In which application are fine-stranded flexible cables most suitable?",
        "Which cable type is suitable for high-frequency module connections?",
        "Which cable type provides better vibration resistance?",
        "Which cable type is suitable for fixed wiring inside electrical control panels?",
        "Which factor increases cable flexibility?",
        "Which factor is least likely to influence cable selection?"
    ]
}